Run the cell below:

In [1]:
import pandas as pd

d = {'firmid':[10,11,12], 'tic':['A','B','C'], 'age':[5,3,4]}

Create a dataframe ``df`` from the dictionary above and print it out.

In [2]:
df = pd.DataFrame(data = d)
df

   firmid tic  age
0      10   A    5
1      11   B    3
2      12   C    4

Change ``df`` so that the data in the ``tic`` column is used as the index to the dataframe. Print out ``df`` after you make this change.

In [3]:
df = df.set_index('tic')
df

     firmid  age
tic
A        10    5
B        11    3
C        12    4

Convert ``tic`` back into a column of ``df`` and print ``df`` after you make this change.

In [4]:
df = df.reset_index()
df

  tic  firmid  age
0   A      10    5
1   B      11    3
2   C      12    4

In a single line of code, rename the ``tic`` column to ``ticker`` and the ``age`` column to ``firm_age``. Then print this new version of ``df``.

In [5]:
df = df.rename(columns = {'tic':'ticker', 'age':'firm_age'})
df

  ticker  firmid  firm_age
0      A      10         5
1      B      11         3
2      C      12         4

Print out a dataframe that contains just just the ``ticker`` and ``firmid`` columns of ``df``.

In [6]:
df[['ticker','firmid']]

  ticker  firmid
0      A      10
1      B      11
2      C      12

Print out the mean of the values in the ``firm_age`` column.

In [7]:
df['firm_age'].mean()

4.0

Print out the cumulative sums of the values in the ``firm_age`` column.

In [8]:
df['firm_age'].cumsum()

0     5
1     8
2    12
Name: firm_age, dtype: int64

Print out the cumulative products of the values in the ``firm_age`` column.

In [9]:
df['firm_age'].cumprod()

0     5
1    15
2    60
Name: firm_age, dtype: int64